Revit 2026 API

# UpdaterRegistry Properties

---

The UpdaterRegistry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

UpdaterRegistry Class

Autodesk.Revit.DB Namespace